# AGGREGATE 2

In [119]:
import pandas as pd
import numpy as np
df = pd.DataFrame({'gruplar': ["A","B","C","A","B","C"],
                  'degiskenler1': [11,22,33,44,55,66],
                  'degiskenler2': [111,222,333,444,555,666]},
                 columns = ['gruplar','degiskenler1','degiskenler2'])
df

  gruplar  degiskenler1  degiskenler2
0       A            11           111
1       B            22           222
2       C            33           333
3       A            44           444
4       B            55           555
5       C            66           666

In [114]:
df.groupby('gruplar').mean()

         degiskenler1  degiskenler2
gruplar
A                27.5         277.5
B                38.5         388.5
C                49.5         499.5

In [128]:
df.groupby("gruplar").aggregate({"degiskenler1": "min", "degiskenler2": "max"})

         degiskenler1  degiskenler2
gruplar
A                  11           444
B                  22           555
C                  33           666